In [142]:
import pandas as pd

travel_trip_data = "../data/raw/Travel details dataset.csv"
travel_trip_hoaithuong_df = pd.read_csv(travel_trip_data, encoding='ISO-8859-1')
travel_trip_hoaithuong_df.head(10)

,ï»¿Trip ID,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
0,1,"London, UK",5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
1,2,"Phuket, Thailand",6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
2,3,"Bali, Indonesia",7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
3,4,"New York, USA",8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
4,5,"Tokyo, Japan",9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200
5,6,"Paris, France",10/5/2023,10/10/2023,5.0,Michael Brown,42.0,Male,American,Hotel,1500,Flight,800
6,7,"Sydney, Australia",11/20/2023,11/30/2023,10.0,Emily Davis,33.0,Female,Australian,Hostel,500,Flight,1200
7,8,"Rio de Janeiro, Brazil",1/5/2024,1/12/2024,7.0,Lucas Santos,25.0,Male,Brazilian,Airbnb,900,Flight,600
8,9,"Amsterdam, Netherlands",2/14/2024,2/21/2024,7.0,Laura Janssen,31.0,Female,Dutch,Hotel,1200,Train,200
9,10,"Dubai, United Arab Emirates",3/10/2024,3/17/2024,7.0,Mohammed Ali,39.0,Male,Emirati,Resort,2500,Flight,800

In [143]:
travel_trip_hoaithuong_df.shape

(139, 13)

In [144]:
travel_trip_hoaithuong_df.columns

Index(['ï»¿Trip ID', 'Destination', 'Start date', 'End date',
       'Duration (days)', 'Traveler name', 'Traveler age', 'Traveler gender',
       'Traveler nationality', 'Accommodation type', 'Accommodation cost',
       'Transportation type', 'Transportation cost'],
      dtype='object')

In [145]:
travel_trip_hoaithuong_df.columns = travel_trip_hoaithuong_df.columns.str.replace("ï»¿", "", regex=False).str.replace(r"[()]", "", regex=True).str.strip(")").str.replace(" ","_").str.lower()

In [146]:
travel_trip_hoaithuong_df.columns

Index(['trip_id', 'destination', 'start_date', 'end_date', 'duration_days',
       'traveler_name', 'traveler_age', 'traveler_gender',
       'traveler_nationality', 'accommodation_type', 'accommodation_cost',
       'transportation_type', 'transportation_cost'],
      dtype='object')

In [147]:
travel_trip_hoaithuong_df.head(5)

,trip_id,destination,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
0,1,"London, UK",5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
1,2,"Phuket, Thailand",6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
2,3,"Bali, Indonesia",7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
3,4,"New York, USA",8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
4,5,"Tokyo, Japan",9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200

In [148]:
# Clean columns start_date

In [149]:
travel_trip_hoaithuong_df['start_date'].unique()
#extract the list of unique values

array(['5/1/2023', '6/15/2023', '7/1/2023', '8/15/2023', '9/10/2023',
       '10/5/2023', '11/20/2023', '1/5/2024', '2/14/2024', '3/10/2024',
       '4/1/2024', '5/15/2024', '6/10/2024', '7/1/2024', '8/20/2024',
       '9/5/2024', '9/1/2023', '7/22/2023', '12/5/2023', '11/1/2023',
       '9/15/2023', '12/22/2023', '8/1/2023', '10/20/2023', '5/10/2022',
       '6/15/2022', '7/2/2022', '8/20/2022', '9/5/2022', '10/12/2022',
       '11/8/2022', '1/5/2023', '2/14/2023', '3/23/2023', '4/19/2023',
       '6/12/2022', '1/2/2023', '12/10/2022', '11/20/2022', '3/5/2023',
       '8/18/2023', '9/15/2022', '7/10/2022', '6/20/2023', '10/10/2023',
       '11/5/2023', '12/24/2023', '1/15/2024', '2/1/2024', '3/15/2024',
       '4/5/2024', '5/10/2024', '6/20/2024', '7/15/2024', '7/12/2022',
       '9/3/2022', '1/7/2023', '6/23/2023', '5/6/2024', '7/20/2024',
       '9/8/2024', '2/14/2025', '5/21/2025', nan, '8/5/2022', '1/1/2023',
       '4/15/2023', '6/7/2023', '11/12/2023', '2/5/2024', '1/1/2025',
       '4/15/2025', '6/15/2021', '7/1/2021', '8/10/2021', '9/1/2021',
       '10/15/2021', '11/20/2021', '1/1/2022', '2/14/2022', '3/10/2022',
       '4/15/2022', '5/1/2022', '9/1/2022', '11/23/2022', '5/8/2023',
       '8/20/2023', '1/6/2024', '4/3/2024', '7/22/2024', '10/10/2024',
       '5/15/2022', '6/20/2022', '8/12/2022', '7/1/2022', '6/10/2022',
       '7/15/2022', '8/25/2022', '9/10/2022', '2/5/2022', '3/15/2022',
       '7/20/2022', '8/8/2022', '9/20/2022', '10/5/2022', '11/11/2022',
       '12/24/2022', '2/10/2023', '5/15/2023', '6/1/2023', '7/15/2023',
       '10/1/2023'], dtype=object)

In [150]:
travel_trip_hoaithuong_df['start_date'].dtype

dtype('O')

In [151]:
travel_trip_hoaithuong_df[travel_trip_hoaithuong_df['start_date'].isna()]

,trip_id,destination,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
71,72,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
127,128,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [152]:
travel_trip_hoaithuong_df["start_date"].isna().sum()

np.int64(2)

In [153]:
travel_trip_hoaithuong_df["start_date"].nunique()

111

In [154]:
travel_trip_hoaithuong_df['start_date'] = pd.to_datetime(travel_trip_hoaithuong_df['start_date'], format='%m/%d/%Y')
print(travel_trip_hoaithuong_df['start_date'])

0     2023-05-01
1     2023-06-15
2     2023-07-01
3     2023-08-15
4     2023-09-10
         ...
134   2023-08-01
135   2023-08-15
136   2023-09-01
137   2023-09-15
138   2023-10-01
Name: start_date, Length: 139, dtype: datetime64[ns]

In [155]:
# Convert the 'end_date' column to datetime first (if not already done)
travel_trip_hoaithuong_df['start_date'] = pd.to_datetime(
    travel_trip_hoaithuong_df['start_date'], 
    errors='coerce'
)

# Use .dt.strftime('%Y-%m') to format the date to Year and Month only.
travel_trip_hoaithuong_df['start_date'] = travel_trip_hoaithuong_df['start_date'].dt.strftime('%Y-%m')

# Optional: Display the new data type and values
print(travel_trip_hoaithuong_df[['start_date']].head())

  start_date
0    2023-05
1    2023-06
2    2023-07
3    2023-08
4    2023-09

In [156]:
 travel_trip_hoaithuong_df

,trip_id,destination,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost
0,1,"London, UK",2023-05,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
1,2,"Phuket, Thailand",2023-06,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
2,3,"Bali, Indonesia",2023-07,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
3,4,"New York, USA",2023-08,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
4,5,"Tokyo, Japan",2023-09,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200
...,...,...,...,...,...,...,...,...,...,...,...,...,...
134,135,"Rio de Janeiro, Brazil",2023-08,8/10/2023,9.0,Jose Perez,37.0,Male,Brazilian,Hostel,2500,Car,2000
135,136,"Vancouver, Canada",2023-08,8/21/2023,6.0,Emma Wilson,29.0,Female,Canadian,Hotel,5000,Airplane,3000
136,137,"Bangkok, Thailand",2023-09,9/8/2023,7.0,Ryan Chen,34.0,Male,Chinese,Hostel,2000,Train,1000
137,138,"Barcelona, Spain",2023-09,9/22/2023,7.0,Sofia Rodriguez,25.0,Female,Spanish,Airbnb,6000,Airplane,2500
138,139,"Auckland, New Zealand",2023-10,10/8/2023,7.0,William Brown,39.0,Male,New Zealander,Hotel,7000,Train,2500

In [157]:
travel_trip_hoaithuong_df['start_date'] = pd.to_datetime(travel_trip_hoaithuong_df['start_date'], errors='coerce')
travel_trip_hoaithuong_df['start_date']

0     2023-05-01
1     2023-06-01
2     2023-07-01
3     2023-08-01
4     2023-09-01
         ...
134   2023-08-01
135   2023-08-01
136   2023-09-01
137   2023-09-01
138   2023-10-01
Name: start_date, Length: 139, dtype: datetime64[ns]

In [158]:
travel_trip_hoaithuong_df['start_month'] = travel_trip_hoaithuong_df['start_date'].dt.strftime('%B')
travel_trip_hoaithuong_df['start_month']

0            May
1           June
2           July
3         August
4      September
         ...
134       August
135       August
136    September
137    September
138      October
Name: start_month, Length: 139, dtype: object

In [159]:
travel_trip_hoaithuong_df.head()

,trip_id,destination,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost,start_month
0,1,"London, UK",2023-05-01,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600,May
1,2,"Phuket, Thailand",2023-06-01,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500,June
2,3,"Bali, Indonesia",2023-07-01,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700,July
3,4,"New York, USA",2023-08-01,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000,August
4,5,"Tokyo, Japan",2023-09-01,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200,September

In [160]:
travel_trip_hoaithuong_df["start_date"] = pd.to_datetime(
    travel_trip_hoaithuong_df["start_date"], errors="coerce"
)

travel_trip_hoaithuong_df["start_year"] = (
    travel_trip_hoaithuong_df["start_date"].dt.year.astype("Int64")
)
travel_trip_hoaithuong_df.head()

,trip_id,destination,start_date,end_date,duration_days,traveler_name,traveler_age,traveler_gender,traveler_nationality,accommodation_type,accommodation_cost,transportation_type,transportation_cost,start_month,start_year
0,1,"London, UK",2023-05-01,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600,May,2023
1,2,"Phuket, Thailand",2023-06-01,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500,June,2023
2,3,"Bali, Indonesia",2023-07-01,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700,July,2023
3,4,"New York, USA",2023-08-01,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000,August,2023
4,5,"Tokyo, Japan",2023-09-01,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200,September,2023

In [161]:
#Clean columns: traveler_nationality

In [162]:
 travel_trip_hoaithuong_df['traveler_nationality'].unique()

array(['American', 'Canadian', 'Korean', 'British', 'Vietnamese',
       'Australian', 'Brazilian', 'Dutch', 'Emirati', 'Mexican',
       'Spanish', 'Chinese', 'German', 'Moroccan', 'Scottish', 'Japanese',
       'Italian', 'Indian', 'South Korean', 'French', nan,
       'South African', 'Taiwanese', 'Indonesian', 'USA', 'Canada',
       'South Korea', 'UK', 'China', 'Taiwan', 'Japan', 'Spain', 'Brazil',
       'Germany', 'Hong Kong', 'United Kingdom', 'Singapore', 'Italy',
       'Greece', 'United Arab Emirates', 'Cambodia', 'New Zealander'],
      dtype=object)

In [163]:
travel_trip_hoaithuong_df['traveler_nationality'].str.strip().str.lower().str.title()

0           American
1           Canadian
2             Korean
3            British
4         Vietnamese
           ...
134        Brazilian
135         Canadian
136          Chinese
137          Spanish
138    New Zealander
Name: traveler_nationality, Length: 139, dtype: object

In [164]:
travel_trip_hoaithuong_df['traveler_nationality'].value_counts()

traveler_nationality
American                24
Korean                  13
British                 12
Canadian                 9
Australian               8
Spanish                  7
Chinese                  7
Italian                  4
Brazilian                4
Indian                   4
Vietnamese               3
South Korea              3
South Korean             3
Taiwan                   2
Canada                   2
USA                      2
South African            2
Japanese                 2
Mexican                  2
Emirati                  2
Dutch                    2
Brazil                   1
Cambodia                 1
United Arab Emirates     1
Greece                   1
Italy                    1
Singapore                1
United Kingdom           1
Hong Kong                1
Germany                  1
Japan                    1
Spain                    1
Scottish                 1
China                    1
UK                       1
German                   1
Indonesian               1
Taiwanese                1
Moroccan                 1
French                   1
New Zealander            1
Name: count, dtype: int64

In [165]:
mapping = {
    'American': 'United States',
    'USA': 'United States',
    'Canada': 'Canada',
    'Canadian': 'Canada',
    'UK': 'United Kingdom',
    'United Kingdom': 'United Kingdom',
    'British': 'United Kingdom',
    'Scottish': 'United Kingdom',
    'Korean': 'South Korea',
    'South Korea': 'South Korea',
    'South Korean': 'South Korea',
    'China': 'China',
    'Chinese': 'China',
    'Italy': 'Italy',
    'Italian': 'Italy',
    'Brazil': 'Brazil',
    'Brazilian': 'Brazil',
    'Emirati': 'United Arab Emirates',
    'United Arab Emirates': 'United Arab Emirates',
    'Taiwan': 'Taiwan',
    'Taiwanese': 'Taiwan',
    'Germany': 'Germany',
    'German': 'Germany',
    'Spain': 'Spain',
    'Spanish': 'Spain',
    'Japan': 'Japan',
    'Japanese': 'Japan'
}

travel_trip_hoaithuong_df['traveler_nationality_clean'] = travel_trip_hoaithuong_df['traveler_nationality'].replace(mapping)

In [166]:
travel_trip_hoaithuong_df['traveler_nationality_clean'].value_counts()

traveler_nationality_clean
United States           26
South Korea             19
United Kingdom          15
Canada                  11
China                    8
Spain                    8
Australian               8
Brazil                   5
Italy                    5
Indian                   4
United Arab Emirates     3
Vietnamese               3
Japan                    3
Taiwan                   3
Dutch                    2
Mexican                  2
Germany                  2
South African            2
Singapore                1
Cambodia                 1
Greece                   1
Moroccan                 1
Hong Kong                1
Indonesian               1
French                   1
New Zealander            1
Name: count, dtype: int64

In [167]:
travel_trip_hoaithuong_df['traveler_nationality'].dtype

dtype('O')

In [168]:
travel_trip_hoaithuong_df['traveler_nationality'].astype('string')

0           American
1           Canadian
2             Korean
3            British
4         Vietnamese
           ...
134        Brazilian
135         Canadian
136          Chinese
137          Spanish
138    New Zealander
Name: traveler_nationality, Length: 139, dtype: string

In [169]:
travel_trip_hoaithuong_df['traveler_nationality'].isna().sum()

np.int64(2)

In [170]:
# Clean columns traveler_gender

In [171]:
travel_trip_hoaithuong_df['traveler_gender'].unique()

array(['Male', 'Female', nan], dtype=object)

In [172]:
travel_trip_hoaithuong_df['traveler_gender'].value_counts()

traveler_gender
Female    70
Male      67
Name: count, dtype: int64

In [173]:
travel_trip_hoaithuong_df['traveler_gender'].isna().sum()

np.int64(2)

In [174]:
travel_trip_hoaithuong_df['traveler_gender'].str.strip().str.title()

0        Male
1      Female
2        Male
3      Female
4      Female
        ...
134      Male
135    Female
136      Male
137    Female
138      Male
Name: traveler_gender, Length: 139, dtype: object

In [175]:
travel_trip_hoaithuong_df["traveler_gender"] = (
    travel_trip_hoaithuong_df["traveler_gender"].fillna("Unknown")
)
travel_trip_hoaithuong_df['traveler_gender'].value_counts()

traveler_gender
Female     70
Male       67
Unknown     2
Name: count, dtype: int64

In [ ]:
# Clean columns accommodation_type

In [176]:
travel_trip_hoaithuong_df['accommodation_type'].unique()

array(['Hotel', 'Resort', 'Villa', 'Airbnb', 'Hostel', 'Riad',
       'Vacation rental', nan, 'Guesthouse'], dtype=object)

In [182]:
travel_trip_hoaithuong_df['accommodation_type'] = travel_trip_hoaithuong_df['accommodation_type'].fillna('Unknown')
travel_trip_hoaithuong_df['accommodation_type'].value_counts()

accommodation_type
Hotel              60
Airbnb             30
Hostel             24
Resort             14
Villa               4
Vacation rental     3
Unknown             2
Riad                1
Guesthouse          1
Name: count, dtype: int64

In [190]:
mapping = {
    'Riad': 'Villa',
    'Guesthouse': 'Vacation rental'
}
travel_trip_hoaithuong_df['accommodation_type'] = travel_trip_hoaithuong_df['accommodation_type'].replace(mapping)

In [193]:
travel_trip_hoaithuong_df['accommodation_type'].value_counts()

accommodation_type
Hotel              60
Airbnb             30
Hostel             24
Resort             14
Villa               5
Vacation rental     4
Unknown             2
Name: count, dtype: int64

In [ ]:
# Clean columns accommodation_cost

In [183]:
travel_trip_hoaithuong_df['accommodation_cost'].dtype

dtype('O')

In [184]:
travel_trip_hoaithuong_df['accommodation_cost'].describe()

count      137
unique      53
top       1200
freq         7
Name: accommodation_cost, dtype: object

In [188]:
median_cost = travel_trip_hoaithuong_df['accommodation_cost'].median()
travel_trip_hoaithuong_df['accommodation_cost'] = travel_trip_hoaithuong_df['accommodation_cost'].fillna(median_cost)
travel_trip_hoaithuong_df['accommodation_cost']

0      1200.0
1       800.0
2      1000.0
3      2000.0
4       700.0
        ...
134    2500.0
135    5000.0
136    2000.0
137    6000.0
138    7000.0
Name: accommodation_cost, Length: 139, dtype: float64

In [189]:
travel_trip_hoaithuong_df.loc[:, "accommodation_cost"] = (
    travel_trip_hoaithuong_df["accommodation_cost"]
        .astype(str)                      # in case there are numbers/NaN in there
        .str.strip()
        .str.strip("$")
        .str.replace(",", "", regex=False)
        .str.replace(" USD", "", regex=False)
        .str.strip()
)

travel_trip_hoaithuong_df.loc[:, "accommodation_cost"] = pd.to_numeric(
    travel_trip_hoaithuong_df["accommodation_cost"],
    errors="coerce"
)

travel_trip_hoaithuong_df.accommodation_cost.unique()

/var/folders/63/sqz7vhsn42v0_qx7gj0dnxfr0000gn/T/ipykernel_31891/1662941867.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '['1200.0' '800.0' '1000.0' '2000.0' '700.0' '1500.0' '500.0' '900.0'
 '1200.0' '2500.0' '1000.0' '800.0' '3000.0' '1400.0' '600.0' '900.0'
 '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0'
 '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0'
 '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1400.0' '800.0'
 '500.0' '2200.0' '1200.0' '900.0' '600.0' '1500.0' '500.0' '400.0'
 '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0'
 '1100.0' '1100.0' '1100.0' '1100.0' '1200.0' '400.0' '800.0' '1500.0'
 '900.0' '2200.0' '1100.0' '1000.0' '300.0' '1300.0' '1800.0' '1100.0'
 '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0'
 '1100.0' '1100.0' '100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0'
 '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0'
 '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0' '1100.0'
 '1100.0' '1000.0' '800.0' '1200.0' '1500.0' '300.0' '900.0' '2000.0'
 '1100.0' '1000.0' '1500.0' '200.0' '1000.0' '1200.0' '800.0' '900.0'
 '500.0' '1300.0' '700.0' '1200.0' '900.0' '400.0' '800.0' '1100.0'
 '5000.0' '7000.0' '3000.0' '6000.0' '4000.0' '8000.0' '2500.0' '5000.0'
 '2000.0' '6000.0' '7000.0']' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  travel_trip_hoaithuong_df.loc[:, "accommodation_cost"] = (

array([1200.0, 800.0, 1000.0, 2000.0, 700.0, 1500.0, 500.0, 900.0, 2500.0,
       3000.0, 1400.0, 600.0, 1100.0, 2200.0, 400.0, 300.0, 1300.0,
       1800.0, 100.0, 200.0, 5000.0, 7000.0, 6000.0, 4000.0, 8000.0],
      dtype=object)